using System;
using System.Collections.Generic;

namespace MineMods
{
    public class Languages
    {
        public static string lang = "Rus";

        public static Dictionary<string, string> Eng = new Dictionary<string, string>() {
            {"Клиент", "Clientside"},
            {"Сервер,мир", "Server,world"},
            {"Еда", "Food"},
            {"Мебель", "Furniture"},
            {"Транспорт", "Transport"},
            {"Электроника и оружие", "Electronics and Guns"},
            {"Графика", "Graphic"},
            {"Блоки и другое", "Blocks and etc."},
            {"Мод", "Mod"},
            {"Модификация", "Modification"},
            {"Обновить", "Update"},
            {"Скачать", "Download"},
            {"Избранные моды", "Favourite Mods"},
            {"Выход", "Quit"},
            {"Параметры", "Options"},
            {"Шрифт", "Font"},
            {"Мелкий (5pt)", "Small (5pt)"},
            {"Обычный (9pt)", "Normal (9pt)"},
            {"Крупный (12pt)", "Large (12pt)"},
            {"Огромный (15pt)", "Very large (15pt)"},
            {"Язык", "Language"},
            {"Файл с модами", "File with Mods"},
            {"Сообщить об ошибке", "Report Bug"},
            {"Справка", "Help"},
            {"О нас", "About Us"},
            {"О программе", "About Program"}
        };

        public static Dictionary<string, string> Rus = new Dictionary<string, string>() {
            {"Клиент", "Клиент"},
            {"Сервер,мир", "Сервер,мир"},
            {"Еда", "Еда"},
            {"Мебель", "Мебель"},
            {"Транспорт", "Транспорт"},
            {"Электроника и оружие", "Электроника и оружие"},
            {"Графика", "Графика"},
            {"Блоки и другое", "Блоки и другое"},
            {"Мод", "Мод"},
            {"Модификация", "Модификация"},
            {"Обновить", "Обновить"},
            {"Скачать", "Скачать"},
            {"Избранные моды", "Избранные моды"},
            {"Выход", "Выход"},
            {"Параметры", "Параметры"},
            {"Шрифт", "Шрифт"},
            {"Мелкий (5pt)", "Мелкий (5pt)"},
            {"Обычный (9pt)", "Обычный (9pt)"},
            {"Крупный (12pt)", "Крупный (12pt)"},
            {"Огромный (15pt)", "Огромный (15pt)"},
            {"Язык", "Язык"},
            {"Файл с модами", "Файл с модами"},
            {"Сообщить об ошибке", "Сообщить об ошибке"},
            {"Справка", "Справка"},
            {"О нас", "О нас"},
            {"О программе", "О программе"}
        };
    }
}
